DataProcessors/А1И_ЗапускПодПользователем.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<DataProcessor>
		<Properties>
			<Name>А1И_ЗапускПодПользователем</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗначениеПароля</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтрокаЗапуска</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Задержка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

DataProcessors/А1И_ЗапускПодПользователем/Forms/ФормаУправляемая/Ext/Form/Module.bsl
Процедура УстановитьПарольОдинДваТриНажатие(Элемент)
	ЗначениеПароля = "QL0AFWMIX8NRZTKeof9cXsvbvu8=,QL0AFWMIX8NRZTKeof9cXsvbvu8=";
КонецПроцедуры

&НаСервере 
Функция Запустить1СНаСервереДо()
	
	СохраняемоеЗначениеПароляСтарое = "";
	СохраняемоеЗначениеПароля123 	= "QL0AFWMIX8NRZTKeof9cXsvbvu8=,QL0AFWMIX8NRZTKeof9cXsvbvu8=";
	
	ПользовательИБ = Неопределено; 	
	Если ЗначениеЗаполнено(Объект.Пользователь) Тогда
		Попытка
			ИмяРеквизита = "ИдентификаторПользователяИБ"; 
			ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(Объект.Пользователь[ИмяРеквизита]);
		Исключение
			ИмяРеквизита = "Код";
			ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоИмени(СокрЛП(Объект.Пользователь[ИмяРеквизита]));
		КонецПопытки;
	Иначе
		Возврат Неопределено;
	КонецЕсли;

	Если ПользовательИБ <> Неопределено Тогда
		Объект.ЗначениеПароля = ПользовательИБ.СохраняемоеЗначениеПароля;
		ПользовательИБ.СохраняемоеЗначениеПароля = СохраняемоеЗначениеПароля123;
		ПользовательИБ.Записать();
	Иначе 
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат ПользовательИБ.Имя;
КонецФункции

&НаСервере
Процедура Запустить1СНаСервереПосле() 
	Попытка
		ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(Объект.Пользователь.ИдентификаторПользователяИБ);
	Исключение
		ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоИмени(СокрЛП(Объект.Пользователь.Код));
	КонецПопытки;
	
	Попытка
		ПользовательИБ.СохраняемоеЗначениеПароля = Объект.ЗначениеПароля;
		ПользовательИБ.Записать();
	Исключение
		ОписаниеОшибки = ОписаниеОшибки();
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте 
Процедура Пауза(Сек)
  	scr = Новый COMОбъект("WScript.Shell");
    scr.Run("ping 127.0.0.1 -n "+СокрЛП(Число(Сек)+1),0,1);
КонецПроцедуры

&НаКлиенте
Процедура Запустить1С1(Команда)
	ИмяПользователяИБ = Запустить1СНаСервереДо();
	
	Если ИмяПользователяИБ = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Пауза(2);
	
	Попытка
		ЗапуститьСистему("ENTERPRISE " + Объект.СтрокаЗапуска + " /N """ + ИмяПользователяИБ + """ " + "/P 123");
	Исключение
		ОписаниеОшибки = ОписаниеОшибки();
	КонецПопытки;
	
	Пауза(Объект.Задержка);
	
	Запустить1СНаСервереПосле();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Объект.СтрокаЗапуска = "ENTERPRISE " + СтрокаСоединенияИнформационнойБазы();
	Объект.Задержка = 15;
КонецПроцедуры
